# Розробіть скрипт, який приймає шлях до директорії в якості аргументу командного рядка і візуалізує структуру цієї директорії, виводячи імена всіх піддиректорій та файлів. Для кращого візуального сприйняття, імена директорій та файлів мають відрізнятися за кольором.


# Вимоги до завдання:

# Створіть віртуальне оточення Python для ізоляції залежностей проекту.
# Скрипт має отримувати шлях до директорії як аргумент при запуску. Цей шлях вказує, де знаходиться директорія, структуру якої потрібно відобразити.
# Використання бібліотеки colorama для реалізації кольорового виведення.
# Скрипт має коректно відображати як імена директорій, так і імена файлів, використовуючи рекурсивний спосіб обходу директорій(можна, за бажанням, використати не рекурсивний спосіб).
# Повинна бути перевірка та обробка помилок, наприклад, якщо вказаний шлях не існує або він не веде до директорії.


# Рекомендації для виконання:

# Спочатку встановіть бібліотеку colorama. Для цього створіть та активуйте віртуальне оточення Python, а потім встановіть пакет за допомогою pip.
# Використовуйте модуль sys для отримання шляху до директорії як аргументу командного рядка.
# Для роботи з файловою системою використовуйте модуль pathlib.
# Забезпечте належне форматування виводу, використовуючи функції colorama.


# Критерії оцінювання:

# Створення та використання віртуального оточення.
# Правильність отримання та обробки шляху до директорії.
# Точність виведення структури директорії.
# Коректне застосування кольорового виведення за допомогою colorama.
# Якість коду, включаючи читабельність, структурування та коментарі.


# Приклад використання:

# Якщо виконати скрипт та передати йому абсолютний шлях до директорії як параметр.

import sys
from pathlib import Path
from colorama import Fore, Style, init

init(autoreset=True)


def whats_inside(path, level=0):
    path = Path(path)
    colors = [Fore.GREEN, Fore.BLUE, Fore.CYAN, Fore.MAGENTA, Fore.YELLOW]

    if path.is_dir() and path.exists():
        for item in path.iterdir():
            color = colors[level % len(colors)]
            indent = '--' * level

            if item.is_dir():
                print("folder", color+indent + item.name+'/')
                whats_inside(item, level + 1)
            else:
                print(color + indent + item.name)
    else:
        print(Fore.RED + 'Directory does not exist')


path = "\git\PYTHON\goit-pycore-hw-04"
whats_inside(path)


if __name__ == "__main__":
    if len(sys.argv) != 2:
        print(Fore.RED + "Будь ласка, вкажіть шлях до директорії як аргумент.")
    else:
        directory_path = sys.argv[1]
        whats_inside(directory_path)
